amrit817/custom_arm_CM/STM32L4xx/stm32l476_neo_custom_lib.h
/* Legacy defines */
#define GPIO_AFRH_AFRH0                      GPIO_AFRH_AFSEL8
#define GPIO_AFRH_AFRH1                      GPIO_AFRH_AFSEL9
#define GPIO_AFRH_AFRH2                      GPIO_AFRH_AFSEL10
#define GPIO_AFRH_AFRH3                      GPIO_AFRH_AFSEL11
#define GPIO_AFRH_AFRH4                      GPIO_AFRH_AFSEL12
#define GPIO_AFRH_AFRH5                      GPIO_AFRH_AFSEL13
#define GPIO_AFRH_AFRH6                      GPIO_AFRH_AFSEL14
#define GPIO_AFRH_AFRH7                      GPIO_AFRH_AFSEL15

/******************  Bits definition for GPIO_BRR register  ******************/
#define GPIO_BRR_BR0_Pos               (0U)                                    
#define GPIO_BRR_BR0_Msk               (0x1U << GPIO_BRR_BR0_Pos)              /*!< 0x00000001 */
#define GPIO_BRR_BR0                   GPIO_BRR_BR0_Msk                        
#define GPIO_BRR_BR1_Pos               (1U)                                    
#define GPIO_BRR_BR1_Msk               (0x1U << GPIO_BRR_BR1_Pos)              /*!< 0x00000002 */
#define GPIO_BRR_BR1                   GPIO_BRR_BR1_Msk                        
#define GPIO_BRR_BR2_Pos               (2U)                                    
#define GPIO_BRR_BR2_Msk               (0x1U << GPIO_BRR_BR2_Pos)              /*!< 0x00000004 */
#define GPIO_BRR_BR2                   GPIO_BRR_BR2_Msk                        
#define GPIO_BRR_BR3_Pos               (3U)                                    
#define GPIO_BRR_BR3_Msk               (0x1U << GPIO_BRR_BR3_Pos)              /*!< 0x00000008 */
#define GPIO_BRR_BR3                   GPIO_BRR_BR3_Msk                        
#define GPIO_BRR_BR4_Pos               (4U)                                    
#define GPIO_BRR_BR4_Msk               (0x1U << GPIO_BRR_BR4_Pos)              /*!< 0x00000010 */
#define GPIO_BRR_BR4                   GPIO_BRR_BR4_Msk                        
#define GPIO_BRR_BR5_Pos               (5U)                                    
#define GPIO_BRR_BR5_Msk               (0x1U << GPIO_BRR_BR5_Pos)              /*!< 0x00000020 */
#define GPIO_BRR_BR5                   GPIO_BRR_BR5_Msk                        
#define GPIO_BRR_BR6_Pos               (6U)                                    
#define GPIO_BRR_BR6_Msk               (0x1U << GPIO_BRR_BR6_Pos)              /*!< 0x00000040 */
#define GPIO_BRR_BR6                   GPIO_BRR_BR6_Msk                        
#define GPIO_BRR_BR7_Pos               (7U)                                    
#define GPIO_BRR_BR7_Msk               (0x1U << GPIO_BRR_BR7_Pos)              /*!< 0x00000080 */
#define GPIO_BRR_BR7                   GPIO_BRR_BR7_Msk                        
#define GPIO_BRR_BR8_Pos               (8U)                                    
#define GPIO_BRR_BR8_Msk               (0x1U << GPIO_BRR_BR8_Pos)              /*!< 0x00000100 */
#define GPIO_BRR_BR8                   GPIO_BRR_BR8_Msk                        
#define GPIO_BRR_BR9_Pos               (9U)                                    
#define GPIO_BRR_BR9_Msk               (0x1U << GPIO_BRR_BR9_Pos)              /*!< 0x00000200 */
#define GPIO_BRR_BR9                   GPIO_BRR_BR9_Msk                        
#define GPIO_BRR_BR10_Pos              (10U)                                   
#define GPIO_BRR_BR10_Msk              (0x1U << GPIO_BRR_BR10_Pos)             /*!< 0x00000400 */
#define GPIO_BRR_BR10                  GPIO_BRR_BR10_Msk                       
#define GPIO_BRR_BR11_Pos              (11U)                                   
#define GPIO_BRR_BR11_Msk              (0x1U << GPIO_BRR_BR11_Pos)             /*!< 0x00000800 */
#define GPIO_BRR_BR11                  GPIO_BRR_BR11_Msk                       
#define GPIO_BRR_BR12_Pos              (12U)                                   
#define GPIO_BRR_BR12_Msk              (0x1U << GPIO_BRR_BR12_Pos)             /*!< 0x00001000 */
#define GPIO_BRR_BR12                  GPIO_BRR_BR12_Msk                       
#define GPIO_BRR_BR13_Pos              (13U)                                   
#define GPIO_BRR_BR13_Msk              (0x1U << GPIO_BRR_BR13_Pos)             /*!< 0x00002000 */
#define GPIO_BRR_BR13                  GPIO_BRR_BR13_Msk                       
#define GPIO_BRR_BR14_Pos              (14U)                                   
#define GPIO_BRR_BR14_Msk              (0x1U << GPIO_BRR_BR14_Pos)             /*!< 0x00004000 */
#define GPIO_BRR_BR14                  GPIO_BRR_BR14_Msk                       
#define GPIO_BRR_BR15_Pos              (15U)                                   
#define GPIO_BRR_BR15_Msk              (0x1U << GPIO_BRR_BR15_Pos)             /*!< 0x00008000 */
#define GPIO_BRR_BR15                  GPIO_BRR_BR15_Msk                       

/* Legacy defines */
#define GPIO_BRR_BR_0                       GPIO_BRR_BR0
#define GPIO_BRR_BR_1                       GPIO_BRR_BR1
#define GPIO_BRR_BR_2                       GPIO_BRR_BR2
#define GPIO_BRR_BR_3                       GPIO_BRR_BR3
#define GPIO_BRR_BR_4                       GPIO_BRR_BR4
#define GPIO_BRR_BR_5                       GPIO_BRR_BR5
#define GPIO_BRR_BR_6                       GPIO_BRR_BR6
#define GPIO_BRR_BR_7                       GPIO_BRR_BR7
#define GPIO_BRR_BR_8                       GPIO_BRR_BR8
#define GPIO_BRR_BR_9                       GPIO_BRR_BR9
#define GPIO_BRR_BR_10                      GPIO_BRR_BR10
#define GPIO_BRR_BR_11                      GPIO_BRR_BR11
#define GPIO_BRR_BR_12                      GPIO_BRR_BR12
#define GPIO_BRR_BR_13                      GPIO_BRR_BR13
#define GPIO_BRR_BR_14                      GPIO_BRR_BR14
#define GPIO_BRR_BR_15                      GPIO_BRR_BR15


/******************  Bits definition for GPIO_ASCR register  *******************/
#define GPIO_ASCR_ASC0_Pos             (0U)                                    
#define GPIO_ASCR_ASC0_Msk             (0x1U << GPIO_ASCR_ASC0_Pos)            /*!< 0x00000001 */
#define GPIO_ASCR_ASC0                 GPIO_ASCR_ASC0_Msk                      
#define GPIO_ASCR_ASC1_Pos             (1U)                                    
#define GPIO_ASCR_ASC1_Msk             (0x1U << GPIO_ASCR_ASC1_Pos)            /*!< 0x00000002 */
#define GPIO_ASCR_ASC1                 GPIO_ASCR_ASC1_Msk                      
#define GPIO_ASCR_ASC2_Pos             (2U)                                    
#define GPIO_ASCR_ASC2_Msk             (0x1U << GPIO_ASCR_ASC2_Pos)            /*!< 0x00000004 */
#define GPIO_ASCR_ASC2                 GPIO_ASCR_ASC2_Msk                      
#define GPIO_ASCR_ASC3_Pos             (3U)                                    
#define GPIO_ASCR_ASC3_Msk             (0x1U << GPIO_ASCR_ASC3_Pos)            /*!< 0x00000008 */
#define GPIO_ASCR_ASC3                 GPIO_ASCR_ASC3_Msk                      
#define GPIO_ASCR_ASC4_Pos             (4U)                                    
#define GPIO_ASCR_ASC4_Msk             (0x1U << GPIO_ASCR_ASC4_Pos)            /*!< 0x00000010 */
#define GPIO_ASCR_ASC4                 GPIO_ASCR_ASC4_Msk                      
#define GPIO_ASCR_ASC5_Pos             (5U)                                    
#define GPIO_ASCR_ASC5_Msk             (0x1U << GPIO_ASCR_ASC5_Pos)            /*!< 0x00000020 */
#define GPIO_ASCR_ASC5                 GPIO_ASCR_ASC5_Msk                      
#define GPIO_ASCR_ASC6_Pos             (6U)                                    
#define GPIO_ASCR_ASC6_Msk             (0x1U << GPIO_ASCR_ASC6_Pos)            /*!< 0x00000040 */
#define GPIO_ASCR_ASC6                 GPIO_ASCR_ASC6_Msk                      
#define GPIO_ASCR_ASC7_Pos             (7U)                                    
#define GPIO_ASCR_ASC7_Msk             (0x1U << GPIO_ASCR_ASC7_Pos)            /*!< 0x00000080 */
#define GPIO_ASCR_ASC7                 GPIO_ASCR_ASC7_Msk                      
#define GPIO_ASCR_ASC8_Pos             (8U)                                    
#define GPIO_ASCR_ASC8_Msk             (0x1U << GPIO_ASCR_ASC8_Pos)            /*!< 0x00000100 */
#define GPIO_ASCR_ASC8                 GPIO_ASCR_ASC8_Msk                      
#define GPIO_ASCR_ASC9_Pos             (9U)                                    
#define GPIO_ASCR_ASC9_Msk             (0x1U << GPIO_ASCR_ASC9_Pos)            /*!< 0x00000200 */
#define GPIO_ASCR_ASC9                 GPIO_ASCR_ASC9_Msk                      
#define GPIO_ASCR_ASC10_Pos            (10U)                                   
#define GPIO_ASCR_ASC10_Msk            (0x1U << GPIO_ASCR_ASC10_Pos)           /*!< 0x00000400 */
#define GPIO_ASCR_ASC10                GPIO_ASCR_ASC10_Msk                     
#define GPIO_ASCR_ASC11_Pos            (11U)                                   
#define GPIO_ASCR_ASC11_Msk            (0x1U << GPIO_ASCR_ASC11_Pos)           /*!< 0x00000800 */
#define GPIO_ASCR_ASC11                GPIO_ASCR_ASC11_Msk                     
#define GPIO_ASCR_ASC12_Pos            (12U)                                   
#define GPIO_ASCR_ASC12_Msk            (0x1U << GPIO_ASCR_ASC12_Pos)           /*!< 0x00001000 */
#define GPIO_ASCR_ASC12                GPIO_ASCR_ASC12_Msk                     
#define GPIO_ASCR_ASC13_Pos            (13U)                                   
#define GPIO_ASCR_ASC13_Msk            (0x1U << GPIO_ASCR_ASC13_Pos)           /*!< 0x00002000 */
#define GPIO_ASCR_ASC13                GPIO_ASCR_ASC13_Msk                     
#define GPIO_ASCR_ASC14_Pos            (14U)                                   
#define GPIO_ASCR_ASC14_Msk            (0x1U << GPIO_ASCR_ASC14_Pos)           /*!< 0x00004000 */
#define GPIO_ASCR_ASC14                GPIO_ASCR_ASC14_Msk                     
#define GPIO_ASCR_ASC15_Pos            (15U)                                   
#define GPIO_ASCR_ASC15_Msk            (0x1U << GPIO_ASCR_ASC15_Pos)           /*!< 0x00008000 */
#define GPIO_ASCR_ASC15                GPIO_ASCR_ASC15_Msk                     

